<?php

namespace VeryBuy\Payment\EsunBank\Acq\CardLink\Response;

use InvalidArgumentException;

trait ResponseMessageTrait
{
    /**
     * @var array
     */
    protected $messages = [
        '00' => '核准',
        '01' => '請查詢銀行',
        '33' => '過期卡',
        '54' => '卡片過期',
        '62' => '尚未開卡',
        'L1' => '產品代碼錯誤',
        'L2' => '期數錯誤',
        'L3' => '不支援分期(他行卡)',
        'L4' => '產品代碼過期',
        'L5' => '金額無效',
        'L6' => '不支援分期',
        'L7' => '非限定卡別交易',
        'XA' => '紅利自付額有誤',
        'XB' => '紅利商品數量有誤',
        'XC' => '紅利商品數量超過可折抵上限',
        'XD' => '紅利商品折抵點數超過最高折',
        'XE' => '紅利商品傳入之固定點數有誤',
        'XF' => '紅利折抵金額超過消費金額',
        'X1' => '不允許使用紅利折抵現金功能',
        'X2' => '點數未達可折抵點數下限',
        'X3' => '他行卡不支援紅利折抵',
        'X4' => '此活動已逾期',
        'X5' => '金額未超過限額不允許使用',
        'X6' => '特店不允許紅利交易',
        'X7' => '點數不足',
        'X8' => '非正卡持卡人',
        'X9' => '紅利商品編號有誤或空白',
        'ET' => '銀聯卡自訂回覆碼',
        'UE' => '請聯繫收單銀行',
        'TE' => 'Token 格式錯誤',
        'TI' => '無效 Token',
        'G0' => '系統功能有誤',
        'G1' => '交易異常',
        'G2' => '資料格式錯誤',
        'G3' => '非使用中特店',
        'G4' => '特店交易類型不合',
        'G5' => '連線IP不合',
        'G6' => '訂單編號重複',
        'G7' => '使用未定義之紅利點數進行交易',
        'G8' => '押碼錯誤',
        'G9' => 'Session 檢查有誤',
        'GA' => '無效的持卡人資料',
        'GB' => '不允許執行授權取消交易',
        'GC' => '交易資料逾期',
        'GD' => '查無訂單編號',
        'GE' => '查無交易明細',
        'GF' => '交易資料狀態不符',
        'GG' => '交易失敗',
        'GH' => '訂單編號重複送出交易',
        'GI' => '銀行紅利狀態不符',
        'GJ' => '出團日期不合法',
        'GK' => '延後出團天數超過限定天數',
        'GL' => '非限定特店，不可使用「玉山卡」參數',
        'GM' => '限定特店，必須傳送「玉山卡」參數',
        'GN' => '該卡號非玉山卡所屬',
        'GP' => '銀行紅利與分期只能二選一',
        'GR' => '使用者取消刷卡頁面',
        'GS' => '系統暫停服務',
        'GT' => '交易時間逾時',
        'GU' => '預先授權重覆交易',
        'GV' => '無預先授權成功交易紀錄',
        'GW' => '無預先授權交易紀錄',
        'GX' => '3D 交易異常',
        'GY' => '3D 交易異常',
        'GZ' => '3D 交易異常',
        'V0' => '3D 驗證失敗',
        'V1' => '3D 交易異常',
        'V2' => '發卡行(ACS)系統異常',
        'VA' => '取消交易金額有誤',
        'VD' => '取消交易時間不合法(日期)',
        'VT' => '取消交易時間不合法(時間)',
        'RA' => '退貨交易金額有誤',
        'RD' => '超過退貨交易期限',
        'RP' => '退貨交易不符',
        'N1' => '紅利點數與金額不符',
        'NM' => '未設定特店類型或英文名稱',
        'NR' => '不允許退貨交易',
        'NT' => '未設定為銀聯卡交易特店',
        'NV' => '不允許取消交易',
        'Z0' => 'URL 錯誤',
        'Z1' => '不允許銀聯交易',
        'Z2' => '無法進行完全 3D 交易',
        'QQ' => '不允許 Debit Card 交易',
        '其他' => '拒絕交易',
    ];

    /**
     * @param string $code
     *
     * @return bool
     */
    protected function hasMessage($code)
    {
        return array_key_exists($code, $this->messages);
    }

    /**
     * @param string $code
     *
     * @throws InvalidArgumentException
     *
     * @return string
     */
    protected function parseMessage($code)
    {
        if (!$this->hasMessage($code)) {
            throw new InvalidArgumentException('Do not have this code:'.$code);
        }

        return $this->messages[$code];
    }
}
